# Introduction to data analysis with PANDAS

## Load the USC Advertising dataset and explore the dataset

In [2]:
import pandas as pd
url = "http://www-bcf.usc.edu/~gareth/ISL/Advertising.csv"
ad = pd.read_csv(url, index_col=0)   ##reseting index to 1 using col 0

### Another way to load data

In [ ]:
##load the iris dataset directly from sklearn, note this is numpy data and not pandas data
from sklearn.datasets import load_iris
iris_np = load_iris()

## General data exploration

In [6]:
print(ad.shape)

(200, 4)

In [4]:
print(ad.head())

      TV  Radio  Newspaper  Sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

Sales numbers are in units of sale while all other variables are in thousand U.S. dollars.

In [5]:
print(ad.tail())

        TV  Radio  Newspaper  Sales
196   38.2    3.7       13.8    7.6
197   94.2    4.9        8.1    9.7
198  177.0    9.3        6.4   12.8
199  283.6   42.0       66.2   25.5
200  232.1    8.6        8.7   13.4

In [5]:
print(ad.describe())

               TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

Find the line that contains the max

In [4]:
ad['TV'].argmax()

102

In [10]:
ad.loc[102]

TV           296.4
radio         36.3
newspaper    100.9
sales         23.8
Name: 102, dtype: float64

## Data indexing and slicing

Pandas uses brackets [] for data slicing. It can be combined with indexing. Using indexing with brackets together is more flexible. 
With brackets, rows are assumed. If columns are also needed, a comma is a separater. They are written as [rows, columns].

### Working with columns

Slicing only one col, using col name or index. Col number starts from left to right at 0. When specifying col numbers, rows must always be specified before the comma. Row numbers cannot be left blank. To include all rows, a semicolon is required.

In [4]:
#select a col using col name
ad['TV'].head()

1    230.1
2     44.5
3     17.2
4    151.5
5    180.8
Name: TV, dtype: float64

In [75]:
#select a col using index
ad.iloc[: , 0].head()

1    230.1
2     44.5
3     17.2
4    151.5
5    180.8
Name: TV, dtype: float64

Slicing multiple cols.

In [12]:
ad[['TV','Radio', 'Newspaper']].head()

      TV  Radio  Newspaper
1  230.1   37.8       69.2
2   44.5   39.3       45.1
3   17.2   45.9       69.3
4  151.5   41.3       58.5
5  180.8   10.8       58.4

In [78]:
ad.iloc[ : , :3].head()

      TV  Radio  Newspaper
1  230.1   37.8       69.2
2   44.5   39.3       45.1
3   17.2   45.9       69.3
4  151.5   41.3       58.5
5  180.8   10.8       58.4

To slice a range of columns, use iloc or loc. All rows (with :) and columns 1-2. Cols of TV and Sales are excluded.

In [71]:
ad.iloc[:,1:3].head()

   Radio  Newspaper
1   37.8       69.2
2   39.3       45.1
3   45.9       69.3
4   41.3       58.5
5   10.8       58.4

### Working with rows

Row numbers can be directly specified using brackets without specifying col numbers. Get rows of data using the internal row index. Up to row 3 (row 3 not included, 0 based). Note the index col is renumbered to 1 based. See later discussion on loc vs iloc. If loc is not reset (the default), loc = iloc.

In [27]:
ad[:3]

      TV  Radio  Newspaper  Sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3

loc vs iloc: loc is label based and label can be changed (to eg a letter or some other user-specified number); iloc is position based and uses the internal index, which is always 0 based number.

In [62]:
ad.loc[1]

TV           230.1
Radio         37.8
Newspaper     69.2
Sales         22.1
Name: 1, dtype: float64

In [63]:
ad.iloc[1]

TV           44.5
Radio        39.3
Newspaper    45.1
Sales        10.4
Name: 2, dtype: float64

Let's change the index to the default zero based values

In [97]:
adcopy = ad
newad = adcopy.set_index([range(200)])
newad.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [98]:
newad.loc[1]

TV           44.5
Radio        39.3
Newspaper    45.1
Sales        10.4
Name: 1, dtype: float64

In [99]:
newad.iloc[1]

TV           44.5
Radio        39.3
Newspaper    45.1
Sales        10.4
Name: 1, dtype: float64

In [ ]:
You can skip rows using :: operator. To skip up to three (ie 2):

In [32]:
ad[::3].head()

       TV  Radio  Newspaper  Sales
1   230.1   37.8       69.2   22.1
4   151.5   41.3       58.5   18.5
7    57.5   32.8       23.5   11.8
10  199.8    2.6       21.2   10.6
13   23.8   35.1       65.9    9.2

In [33]:
ad[::1].head()
ad[::2].head()

      TV  Radio  Newspaper  Sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

You can perform the same skipping in reverse

In [35]:
ad[::-2].head()

        TV  Radio  Newspaper  Sales
200  232.1    8.6        8.7   13.4
198  177.0    9.3        6.4   12.8
196   38.2    3.7       13.8    7.6
194  166.8   42.0        3.6   19.6
192   75.5   10.8        6.0    9.9

### Working with columns and rows

To slice rows and cols, you can use iloc

In [81]:
ad.iloc[::-2, :2].head()

        TV  Radio
200  232.1    8.6
198  177.0    9.3
196   38.2    3.7
194  166.8   42.0
192   75.5   10.8

In [49]:
ad.iloc[::-2, ::2].head()

        TV  Newspaper
200  232.1        8.7
198  177.0        6.4
196   38.2       13.8
194  166.8        3.6
192   75.5        6.0

### Pandas object types
1. Series: one dimension arrays, like Python's lists. It is a special type of Data Frame with one row or column
2. Data frame: two-dimentional arrays, like a matrix
3. Panel

In [ ]:
adTV = ad['TV']
adrow1 = ad[:1]
adrow1
adrow1.values                       ##values only without headers and row index

## Data operations

In [36]:
adcopy = ad.copy()
adcopy.head()

      TV  Radio  Newspaper  Sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

In [112]:
adcopy[:3] = 0
adcopy.head()

      TV  Radio  Newspaper  Sales
1    0.0    0.0        0.0    0.0
2    0.0    0.0        0.0    0.0
3    0.0    0.0        0.0    0.0
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

In [113]:
ad.loc[1]

TV           0.0
Radio        0.0
Newspaper    0.0
Sales        0.0
Name: 1, dtype: float64

Create a data frame with columns

In [114]:
colnames = ['Features', 'R2', 'RSME']
result = pd.DataFrame(columns=colnames)
print result

Empty DataFrame
Columns: [Features, R2, RSME]
Index: []

Use the automatically generated row index by specifying ignore_index=True in append.

In [118]:
adata = pd.DataFrame()                                        ##row index initialized to all zeros and cannot be changed
addrow = [[['TV'], 0.6522105337388302, 2.9933730574331756]]
adata = adata.append(addrow, ignore_index=True)               ##must be assigned to something, otherwise not appended
print adata

      0         1         2
0  [TV]  0.652211  2.993373

Get data that satisfy certain conditions

In [12]:
##identify if rows with 'TV' > 290; it is a logical output (T|F)
adnew = ad["TV"] > 20
adnew.head()

1     True
2     True
3    False
4     True
5     True
Name: TV, dtype: bool

In [13]:
#only rows of data where 'TV' has values greater than 980, by filter the dataframe with a vector of T/F
ad[ad["TV"] > 290]

        TV  Radio  Newspaper  Sales
31   292.9   28.3       43.2   21.4
36   290.7    4.1        8.5   12.8
43   293.6   27.7        1.8   20.7
102  296.4   36.3      100.9   23.8

In [14]:
##use iloc to print only the first row
ad[ad["TV"] > 290].iloc[0]

TV           292.9
Radio         28.3
Newspaper     43.2
Sales         21.4
Name: 31, dtype: float64

In [15]:
##use the iloc to first row, 4th col (ie Sales)
ad[ad["TV"] > 290].iloc[0, 3]

21.399999999999999

create a new col, its value based on values on some other col, by calling  function to work that col

In [18]:
##this only works for True or False, not more than two results
ad['group'] = np.where(ad['TV'] < 100, '1', '2')
ad.head()

      TV  radio  newspaper  sales group
1  230.1   37.8       69.2   22.1     2
2   44.5   39.3       45.1   10.4     1
3   17.2   45.9       69.3    9.3     1
4  151.5   41.3       58.5   18.5     2
5  180.8   10.8       58.4   12.9     2

In [20]:
##use nested where to have more than one results
ad['group'] = np.where(ad['TV'] < 100, '1', np.where(ad['TV'] < 200, '2', '3'))
ad.head()

      TV  radio  newspaper  sales group
1  230.1   37.8       69.2   22.1     3
2   44.5   39.3       45.1   10.4     1
3   17.2   45.9       69.3    9.3     1
4  151.5   41.3       58.5   18.5     2
5  180.8   10.8       58.4   12.9     2